Revit 2026 API

# IFCImportAction Enumeration

---

The action of the IFC import.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCImportAction
```
```vb
Public Enumeration IFCImportAction
```
```cpp
public enum class IFCImportAction
```
```fsharp
type IFCImportAction
```

| Member name | Value | Description |
| --- | --- | --- |
| Link | 1 | Link into an existing project file. |
| Open | 0 | Open a new project file. |

#### Reference

Autodesk.Revit.DB.IFC Namespace